Revit 2027 API
HVACZoneData Methods
The HVACZoneData type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from GenericZoneDomainData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
HVACZoneData Class
Autodesk.Revit.DB.Mechanical Namespace